In [6]:
import pandas as pd

In [7]:
df = pd.DataFrame({
    "name" : ["billy","Noah","mike","steve","mike"],
    "marks" : [87,72,71,66,71]
})

In [8]:
df

    name  marks
0  billy     87
1   Noah     72
2   mike     71
3  steve     66
4   mike     71

In [17]:
df.drop_duplicates(subset = ["name"], inplace = True)

In [18]:
df

    name  marks
0  billy     87
1   Noah     72
2   mike     71
3  steve     66

In [52]:
df.drop_duplicates(keep = 'last',inplace = True)

In [53]:
df

    name  marks
0  billy     87
1   Noah     72
3  steve     66
4   mike     71

In [18]:
df.drop_duplicates(keep = 'first')

    name  marks
0  billy     87
1   Noah     72
2   mike     71
3  steve     66